app/views/teams/show.html.erb

SELECT "heros".* FROM "heros" WHERE "heros"."team_id" = ?  [["team_id", 1]]
SELECT COUNT(*) FROM "heros" WHERE "heros"."team_id" = ?  [["team_id", 2]]
---
<p>
<% if @team.heros.count > 0 %>
    Your team has the following heros:<br>
    <% @team.heros.each.with_index(1) do |hero, i| %>