app/views/heros/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <p><label class="label">Bio:</label> <%= f.text_area :bio %></p>
    <p><label class="label">Choose a Team:</label><%= f.collection_select :team_id, Team.all, :id, :title, include_blank: "(Optional) Add Hero to a Team" %>