app/views/heros/index.html.erb

SELECT "heros".* FROM "heros"
---
<script type="text/javascript" charset="utf-8">
    $(function () {
        $.get("/heros.json", function(data) {
            data.forEach(function(hero) {
               $("#heros_wrapper").append(
                    `<section class="row" id="hero-${hero.id}" style="margin-bottom: 15px; height:250px;">
                        <div class="col-sm-3">
                            <p>Hero Name: <strong>${hero.name}</strong></p>
                            <p>Hero Battle Cry: ${hero.battle_cry}</p>
                            <p>Hero Bio: ${hero.bio}</p>
                            <p>
                                <a href="/heros/${hero.id}/edit" class="btn btn-info">Edit</a>
                                <a href="/heros/${hero.id}" class="btn btn-info">View</a>
                                <br>
                                <button class="btn btn-danger delete" data-id="${hero.id}">Delete ${hero.name}</button>
                            </p>
                        </div>
                        <div class="col-sm">
                            <img width="300" src="/images/${hero.img_path}">
                        </div>
                    </section>
                    <hr>`

SELECT COUNT(*) FROM "heros"
---

            $("form").on("submit", function(e) {
                e.preventDefault();

                $.get(`/heros.json?search=${this.search.value}`, function(data) {
                    $("#heros_wrapper").empty();
                    if (data.length > 0)  {
                        data.forEach(function(hero) {
                            $("#heros_wrapper").append(
                                    `<section class="row" id="hero-${hero.id}" style="margin-bottom: 15px; height:250px;">
                                        <div class="col-sm-3">
                                            <p>Hero Name: <strong>${hero.name}</strong></p>
                                            <p>Hero Battle Cry: ${hero.battle_cry}</p>
                                            <p>Hero Bio: ${hero.bio}</p>
                                            <p>
                                                <a href="/heros/${hero.id}/edit" class="btn btn-info">Edit</a>
                                                <a href="/heros/${hero.id}" class="btn btn-info">View</a>
                                                <br>
                                                <button class="btn btn-danger delete" data-id="${hero.id}">Delete ${hero.name}</button>
                                            </p>
                                        </div>
                                        <div class="col-sm">