app/views/users/show.html.erb

SELECT COUNT(*) FROM "heros" WHERE "heros"."user_id" = ?  [["user_id", 5]]
---
<% end %>
<% if @user.heros.count < 1 %>

SELECT COUNT(*) FROM "heros" WHERE "heros"."user_id" = ?  [["user_id", 5]]
---
<% else %>
    <p>You currently have <%=@user.heros.count%> hero(s).</p>