app/controllers/heros_controller.rb

    def index
        if params[:team_id]
            @heros = Hero.heros_by_team_id(params[:team_id])

            if params[:search]
                # @heros = @heros.select { |hero| hero.name.downcase.include?(params[:search].downcase) }
                @heros = @heros.where('name LIKE ?', "%#{params[:search]}%")
            else
                @heros
            end
        else
            @heros = current_user.heros

            if params[:search]
                #@heros = @heros.select { |hero| hero.name.downcase.include?(params[:search].downcase) }
                @heros = @heros.where('name LIKE ?', "%#{params[:search]}%")
---
SELECT  "heros".* FROM "heros" WHERE "heros"."team_id" = ? LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
SELECT "heros".* FROM "heros" WHERE "heros"."user_id" = ?  [["user_id", 1]]

    def create
        @hero = Hero.new(hero_params)

        if @hero.save
---
INSERT INTO "heros" ("name", "battle_cry", "bio", "img_path", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @hero.update(hero_params)
---
UPDATE "heros" SET "team_id" = ?, "updated_at" = ? WHERE "heros"."id" = ?  [["team_id", 12], ["updated_at", "2019-05-10 20:34:47.033553"], ["id", 8]]

    def destroy
        @hero.delete
---
DELETE FROM "heros" WHERE "heros"."id" = ?  [["id", 10]]

    def load_hero
        @hero = Hero.find_by(id: params[:id])
---
SELECT  "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]