app/controllers/sessions_controller.rb

    def create
        if request.env["omniauth.auth"]
            #for omniauth generate securerand u.password = method_from securerand
            @user = User.find_or_create_by(uid: auth['uid']) do |u|
                u.name = auth['info']['name']
                u.email = auth['info']['email']
                u.password = SecureRandom.hex(13)
                u.password_confirmation = u.password
            end

            session[:user_id] = @user.id
            puts @user.id
            redirect_to account_path
        else
            @user = User.find_by(email: params[:email])
---
INSERT INTO "users" ("uid", "name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10101616263811559"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bb8@starwars.com"], ["LIMIT", 1]]