app/controllers/teams_controller.rb

INSERT INTO "teams" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "The Mage Clan"], ["created_at", "2019-04-11 16:28:43.840760"], ["updated_at", "2019-04-11 16:28:43.840760"]]
---
    def create
        @team = Team.new(team_params)

        if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def load_team
        if @team = Team.find_by(id: params[:id])