app/controllers/users_controller.rb

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ericc"], ["updated_at", "2019-04-10 23:14:15.525698"], ["id", 3]]

    def destroy
        @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

    def load_user
        if session[:user_id]
            @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]